STM32-SDR/STM32-SDR/STM32-SDR/externals/SM32F4-Discovery/STEmbeddedGUI/src/LcdDriver_ILI9320.c
	uint16_t xStart = MIN(rotatedX1, rotatedX2);
	uint16_t xEnd   = MAX(rotatedX1, rotatedX2);
	uint16_t yStart = MIN(rotatedY1, rotatedY2);
	uint16_t yEnd   = MAX(rotatedY1, rotatedY2);

	xStart = MAX(0, xStart);
	xEnd   = MIN(LCD_ACTUAL_SCREEN_WIDTH-1, xEnd);
	yStart = MAX(0, yStart);
	yEnd   = MIN(LCD_ACTUAL_SCREEN_HEIGHT-1, yEnd);

	LCD_WriteReg(0x0050, xStart); // Window X start address
	LCD_WriteReg(0x0051, xEnd); // Window X end address
	LCD_WriteReg(0x0052, yStart); // Window Y start address
	LCD_WriteReg(0x0053, yEnd); // Window Y end address

	LCD_SetCursor(x, y);
}
void LCD_ResetDisplayWindow(void)
{
	LCD_SetDisplayWindow(0, 0, LCD_HEIGHT, LCD_WIDTH);
}
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
	LCD_WriteReg(0x20, LCD_ROTATE_GETX(Xpos, Ypos));
	LCD_WriteReg(0x21, LCD_ROTATE_GETY(Xpos, Ypos));
}

void LCD_DisplayOn(void)
{
	LCD_WriteReg(0x07, 0x0173);
}
void LCD_DisplayOff(void)
{
	LCD_WriteReg(0x07, 0x0000);
}



void LCD_PutPixel(uint16_t Xpos, uint16_t Ypos, uint16_t Color)
{
	LCD_SetCursor(Xpos, Ypos);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(Color);
}

uint16_t LCD_GetPixel(uint16_t Xpos, uint16_t Ypos)
{
	// TODO: Unable to have GetPixel working.
	// - Data sheet suggests have to read ram twice, but does not seem to help.
	// - Perhaps TTY debugging would help be able to display values quickly?
#if 0
	uint16_t tmpColor = 0, tmpRed = 0, tmpBlue = 0;

	/*Read the color of given pixel*/
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);
	LCD_SetCursor(Xpos, Ypos);
	tmpColor = LCD_ReadRAM();

	/*Swap the R and B color channels*/
	tmpRed = (tmpColor & Blue) << 11;
	tmpBlue = (tmpColor & Red) >> 11;
	tmpColor &= ~(Red | Blue);
	tmpColor |= (tmpRed | tmpBlue);

	return tmpColor;
#else
	return 0;
#endif
}


// ***********************************************************************************
// Drawing Routines
// ***********************************************************************************
/*
 * Draw a 16-bit bitmap to the screen.
 *  Image Generation Tip:
 *  	Use Gimp, load image, File --> Export, type C source code,
 *  	"Save as RGB454 (16-bit)"
 */
void LCD_DrawBMP16Bit(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revByteOrder)
{
	int numPixels = width * height;

	LCD_SetDisplayWindow(x, y, height, width);
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	// Push bitmap data to screen.
	for (int wordNum = 0; wordNum < numPixels; wordNum++) {
		uint16_t color = (*(pBitmap + wordNum));
		if (revByteOrder) {
			color = ((color & 0x00FF) << 8) | ((color & 0xFF00) >> 8);
		}
		LCD_WriteRAM( color );
	}
	LCD_ResetDisplayWindow();
}

// Draw a 1-bit bitmap (monochrome) to the screen.
// Assume each row of bits starts on a new word (i.e., pad last word per row with 0 bits)
void LCD_DrawBMP1Bit(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revBitOrder)
{
	LCD_SetDisplayWindow(x, y, height, width);
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	// Push bitmap data to screen.
	int word = 0;
	for (int row = 0; row < height; row++) {
		for (int col = 0; col < width; col++) {

			// On screen?
			if (x < 0 || x + col >= LCD_WIDTH || y < 0 || y + row >= LCD_HEIGHT) {
				continue;
			}

			// Setup the word:
			if (col % 16 == 0 && col > 0) {
				word++;
			}

			int bit = col % 16;
			if (revBitOrder) {
				bit = 15 - bit;
			}

			uint16_t turnOn = pBitmap[word] & (1 << bit);
			if (turnOn) {
				LCD_WriteRAM( LCD_textColor );
			} else {
				LCD_WriteRAM( LCD_backColor );
			}
		}
		// Assume next row starts on new byte:
		word++;
	}
	LCD_ResetDisplayWindow();
}

// Draw a 1-bit bitmap transparent (monochrome) to the screen.
// Assume each row of bits starts on a new word (i.e., pad last word per row with 0 bits)
// TODO: If this is fast enough, use the pixel-by-pixel approach for transparent and non (reduce duplication)
void LCD_DrawBMP1BitTransparent(int x, int y, int height, int width, const uint16_t* pBitmap, _Bool revBitOrder)
{
	// Push bitmap data to screen.
	int word = 0;
	for (int row = 0; row < height; row++) {
		for (int col = 0; col < width; col++) {

			// On screen?
			if (x < 0 || x + col >= LCD_WIDTH || y < 0 || y + row >= LCD_HEIGHT) {
				continue;
			}

			// Setup the word:
			if (col % 16 == 0 && col > 0) {
				word++;
			}

			int bit = col % 16;
			if (revBitOrder) {
				bit = 15 - bit;
			}

			uint16_t turnOn = pBitmap[word] & (1 << bit);
			if (turnOn) {
				LCD_PutPixel(x + col, y + row, LCD_textColor);
			} else {
				// Nothing; it's transparent!
			}
		}
		// Assume next row starts on new byte:
		word++;
	}
}

void LCD_SetTextColor(__IO uint16_t Color)
{
	LCD_textColor = Color;
}

void LCD_SetBackColor(__IO uint16_t Color)
{
	LCD_backColor = Color;
}

void LCD_Clear(uint16_t Color)
{
	LCD_ResetDisplayWindow();
	LCD_WriteRAM_PrepareDir(LCD_WriteRAMDir_Right);

	for (uint16_t y = 0; y < LCD_HEIGHT; y++) {
		for (uint16_t x = 0; x < LCD_WIDTH; x++) {
			LCD_WriteRAM(Color);
		}
	}
}

void LCD_DrawLine(uint16_t xStart, uint16_t yStart, uint16_t length, LCD_WriteRAM_Direction direction)
{
	LCD_SetCursor(xStart, yStart);
	LCD_WriteRAM_PrepareDir(direction);
	for (uint16_t i = 0; i < length; i++) {
		LCD_WriteRAM(LCD_textColor);
	}
}

void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
	LCD_DrawLine(Xpos, Ypos, Width, LCD_WriteRAMDir_Right);
	LCD_DrawLine(Xpos, Ypos + Height - 1, Width, LCD_WriteRAMDir_Right);
	LCD_DrawLine(Xpos, Ypos, Height, LCD_WriteRAMDir_Down);
	LCD_DrawLine(Xpos + Width - 1, Ypos, Height, LCD_WriteRAMDir_Down);
}



//////////////////////////////////////////////////////////////////////////////////////////////////////
//		Test functions
//////////////////////////////////////////////////////////////////////////////////////////////////////
void LCD_TestDisplayScreen(void)
{
	// Test clear screen
	LCD_Clear(LCD_COLOR_BLUE);
	LCD_Clear(LCD_COLOR_RED);
	LCD_Clear(LCD_COLOR_GREEN);
	LCD_Clear(LCD_COLOR_YELLOW);
	LCD_Clear(LCD_COLOR_BLACK);

	// Test horizontal and vertical lines
	// Lines from origin (top-left)
	LCD_SetTextColor(LCD_COLOR_WHITE);
	LCD_DrawLine(0,0, 100, LCD_WriteRAMDir_Right);
	LCD_DrawLine(0,10, 100, LCD_WriteRAMDir_Right);
	LCD_SetTextColor(LCD_COLOR_YELLOW);
	LCD_DrawLine(0,0, 100, LCD_DIR_VERTICAL);

	// Lines into bottom right corner.
	LCD_SetTextColor(LCD_COLOR_RED);
	LCD_DrawLine(LCD_WIDTH-200-1,LCD_HEIGHT-1, 200, LCD_WriteRAMDir_Right);
	LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_DrawLine(LCD_WIDTH-1,LCD_HEIGHT-50-1, 50, LCD_WriteRAMDir_Down);

