STM32-SDR/STM32-SDR/STM32-SDR/externals/SM32F4-Discovery/STEmbeddedGUI/src/LcdDriver_ILI9320.c
	// Draw + in middle of screen
	int midX = LCD_WIDTH / 2;
	int midY = LCD_HEIGHT / 2;
	int crossLen = 50;
	LCD_SetTextColor(LCD_COLOR_RED);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Right);
	LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Down);
	LCD_SetTextColor(LCD_COLOR_BLUE);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Left);
	LCD_SetTextColor(LCD_COLOR_YELLOW);
	LCD_DrawLine(midX, midY, crossLen, LCD_WriteRAMDir_Up);

	LCD_SetBackColor(LCD_COLOR_BLUE);
	uint16_t data[] = {
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
			0xFF, 0x00, 0xCC, 0x33, 0xAA, 0x55,
	};
	LCD_SetTextColor(LCD_COLOR_WHITE);
	LCD_DrawBMP1Bit(midX+75, midY+75, 5, 48, data, 0);


	// Test DrawRect
	LCD_SetTextColor(LCD_COLOR_RED);
	LCD_DrawRect(10, 50, 150, 50);
	LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_DrawRect(60, 50, 150, 50);
	LCD_SetTextColor(LCD_COLOR_BLUE);
	LCD_DrawRect(110, 50, 150, 50);

	// Test Display Off/On
	LCD_DisplayOff();
	LCD_DisplayOn();
	LCD_BackLight(50);
	LCD_BackLight(0);
	LCD_BackLight(100);

	// Test drawing a bitmap
	extern const struct {
		unsigned int 	 width;
		unsigned int 	 height;
		unsigned int 	 bytes_per_pixel; /* 2:RGB16, 3:RGB, 4:RGBA */
		char         	*comment;
		unsigned char	 pixel_data[320 * 240 * 2 + 1];
	} gimp_image;
	LCD_DrawBMP16Bit(0,0, gimp_image.height, gimp_image.width, (uint16_t*) gimp_image.pixel_data, 0);

	#if 0
	// Test put/get pixel
	LCD_PutPixel(10, 10, 0x1234);
	assert(LCD_GetPixel(10, 10) == 0x1234);
	LCD_PutPixel(10, 10, Red);
	assert(LCD_GetPixel(10, 10) == LCD_COLOR_RED);
	LCD_PutPixel(10, 10, Green);
	assert(LCD_GetPixel(10, 10) == LCD_COLOR_GREEN);
	LCD_PutPixel(10, 10, Blue);
	assert(LCD_GetPixel(10, 10) == LCD_COLOR_BLUE);
	#endif

	volatile int a = 0;
	while (1)
		a ++;
}
